#include <iostream>

using namespace std;

int main()
{
    // Побитови операции
    int a = 6; // ...000110
    int b = 3; // ...000011
    cout << "a && b = " << (a && b) << endl; // true, т.е. 1
    // побитово "и":
    cout << "a & b = " << (a & b) << endl; // ...0000010, т.е. 2
    // побитово "или":
    cout << "a | b = " << (a | b) << endl;//...00111, т.е. 7
    // побитово отрицание:
    cout << "~a = " << (~a) << endl; // 1111...11001
    // отместване наляво:
    int c = 1;
    cout << "c << 3 = " << (c << 3) << endl;//..001000, т.е. 8
    // аналогично има и отместване надясно с >>
    // има и изключващо или - ^

    // пример: да използваме една int променлива,
    // в която всеки бит да служи за отделна булева стойност
    int bitArray = 0;
    int i = 3;
    // да вдигнем i-тия (броейки отдясно наляво) бит:
    bitArray |= (1 << i);
    cout << bitArray << endl; // ...001000, т.е. 8
    // да прочетем i-тия бит:
    cout << (bool)(bitArray & (1 << i)) << endl;
    // да свалим i-тия бит:
    bitArray &= ~(1 << i);
    cout << bitArray << endl;

    return 0;
}

