#include <iostream>
using namespace std;

int main()
{

	/*
		// Да се напише програма, която пресмята цената на дадена покупка по следния начин:
		// Закупени са определен брой еднакви продукти с определена единична цена.
		// Ако общата цена е над 100 лв, да се направи отстъпка от 10%

		int count;
		cout << "Number of products: ";
		cin >> count;

		double unitPrice;
		cout << "Unit price: ";
		cin >> unitPrice;

		double totalPrice = unitPrice * count;
		if (totalPrice > 100)
			totalPrice = totalPrice * 0.9;

		cout << "Total price: " << totalPrice << endl;
	*/

	// Задача: дали x принадлежи на интервала
	// (-infinity, -3] U [-2, -1) U [0, 2)
	/*
			double x;
			cin >> x;
			if (x <= -3 || -2 <= x && x < -1 || x >= 0 && x < 2)
					cout << "Yes";
	*/

	/*
		int month;
		cin >> month;
		if (month == 1) cout << "January";
		else if (month == 2) cout << "February";
		// ...
		else if (month == 12) cout << "December";
		else cout << "Invalid value";

		cout << endl;
	*/

	return 0;
}
