#include <iostream>

using namespace std;

int main()
{
    // По дадени 3 страни на триъгълник да се определи
    // дали е равностранен, равнобедрен, разностранен,
    // както и дали е правоъгълен, остроъгълен или тъпоъгълен.
    // Ако въведените стойности не са валидни, да се изведе
    // подходящо съобщение за грешка.

    double a, b, c;
    cin >> a >> b >> c;

    if (c >= a + b || a >= b + c || b >= c + a)
    {
        cout << "Invalid values." << endl;
    }
    else
    {
        // понеже триъгълникът винаги е един от 3-те
        // вида, пишем проверки за 2-та по-лесни случая
        if (a == b && b == c)
            cout << "equilateral"; // равностранен
        else if (a == b || b == c || c == a) // понеже предишното условие е false,
                                            // няма нужда да проверяваме дали
                                            // третата страна е различна от първите две
            cout << "isosceles"; // равнобедрен
        else
            cout << "scalene"; // разностранен - няма какъв друг да е

        cout << " and ";

        double a2 = a * a, b2 = b * b, c2 = c * c; // за да не ги смятаме многократно
        if (c2 == a2 + b2 || a2 == b2 + c2 || b2 == c2 + a2)
            cout << "right-angled"; // правоъгълен
        else if (a2 + b2 > c2 && b2 + c2 > a2
            && c2 + a2 > b2)
            cout << "acute-angled";
        else
            cout << "obtuse";

        cout << "." << endl;
    }

    return 0;
}

