// Дадени са n цели числа в интервала [1 … 1000]. От тях някакъв процент p1 са под 200, процент p2 са от 200 до 399, процент p3 са от 400 до 599, процент p4 са от 600 до 799 и останалите p5 процента са от 800 нагоре. Да се напише програма, която изчислява и отпечатва процентите p1, p2, p3, p4 и p5.

// Пример: имаме n = 20 числа: 53, 7, 56, 180, 450, 920, 12, 7, 150, 250, 680, 2, 600, 200, 800, 799, 199, 46, 128, 65.

// Получаваме следното разпределение и визуализация:

// task4-histogram.png

// Примери:

// Вход:

// 7
// 800
// 801
// 250
// 199
// 399
// 599
// 799
// Изход:

// 14.29%
// 28.57%
// 14.29%
// 14.29%
// 28.57%
// Вход:

// 4
// 53
// 7
// 56
// 999
// Изход:

// 75.00%
// 0.00%
// 0.00%
// 0.00%
// 25.00%