// По дадено число N изкарайте на екрана квадрат от N x N символи, където под главния диагонал стоят минуси (-), а над главния диагонал стоят плюсове (+)

// Пример:

// Вход: 4

// Изход:

// ++++
// -+++
// --++
// ---+
// Вход: 7

// Изход:

// +++++++
// -++++++
// --+++++
// ---++++
// ----+++
// -----++
// ------+

#include <iostream>
using namespace std;

int main()
{

  int N;
  cout << "Enter square size: ";
  cin >> N;

  for (int i = 0; i < N; i++)
  {
    for (int j = 0; j < N; j++)
    {
      if (j < i)
      {
        cout << "-";
      }
      else
      {
        cout << "+";
      }
    }
    cout << endl;
  }

  return 0;
}
