// От даден масив от сортирани последнователни числа са премахнати някои числа. Напишете фунцкия, която приема такъв масив и връща най-малкото премахнато число.
// Решението ви трябва да работи с логартмична сложност ( а не с линейно минаване през масива).

// Вход: [5 6 7 9 10 12 13]

// Изход: 8 //премахнатите числа са 8 и 11.

// Вход: [10 12 13 14 16]

// Изход: 11 //премахнатите числа са 11 и 16.

// Модифицирайте функцията, за да отпечатване и най-голямото премахнато число

#include <iostream>
using namespace std;

void fillArr(int arr[], int n)
{
  for (int i = 0; i < n; i++)
  {
    cout << "arr[" << i << "] ";
    cin >> arr[i];
  }
}

int main()
{
  int n, arr[1000];

  do
  {
    cout << "Enter array size: ";
    cin >> n;
  } while (n <= 0 || n > 1000);

  fillArr(arr, n);

  return 0;
}