// След въвеждане на цяло число n, да се инициализира масив от n на брой цели числа, като потребителят въвежда n на брой числа. След това да се обходи масива и да се изведат в конзолата всички числа. След това отново да се направи обхождане на масива и да се сметне средното аритметично на числата. (Да се направи и с масив от реални числа).
// Примерен изход при вход 3 2 2 2: [2,2,2] 2

// Примерен изход при вход 4 3 10 10 3: [4,3,10,10,3] 6.5

// Примерен изход при вход 5 0 0 0 0 0: [0,0,0,0,0] 0

// -- Same task from week 7 pract task 0 -- //